export const mockNews = [
	{
		id: 1,
		title: "Новые возможности React",
		summary:
			"Вышел React 18.8. Знакомимся с нововведениями в стеке веб-разработки.",
		date: "Сегодня, 10:45",
		author: "Влад",
		tags: ["технологии", "разработка"],
		reaction: { likes: 120, dislikes: 2 },
		views: 1500,
	},
	{
		id: 2,
		title: "He was an expert but not in a discipline",
		summary:
			"Один из самых обсуждаемых постов англоязычного комьюнити: история о мастерстве, которое никто не замечает, но которое делает жизнь чуть лучше — в каждом шарике мороженого.",
		date: "Вчера, 17:32",
		author: "Гость",
		tags: ["english", "fiction"],
		reaction: { likes: 859, dislikes: 32 },
		views: 4884,
	},
	{
		id: 3,
		title: "Париж: открытие Нотр-Дам и новые рестораны",
		summary:
			"После долгих лет реставрации Нотр-Дам де Пари готовится к торжественному открытию. В городе также появляются новые модные рестораны и культурные пространства — Париж вновь становится магнитом для гурманов и любителей искусства.",
		date: "Сегодня, 09:15",
		author: "Мария",
		tags: ["франция", "культура", "гастрономия"],
		reaction: { likes: 210, dislikes: 5 },
		views: 3200,
	},
	{
		id: 4,
		title: "Франция 2025: баланс между традицией и инновациями",
		summary:
			"Экологический переход, «зелёные коридоры» и жёсткий пограничный контроль — главные тренды Франции. Партия Марин Ле Пен набирает силу, а молодёжь смешивает берберские ритмы с климатическим рэпом в TikTok.",
		date: "Вчера, 14:20",
		author: "Артём",
		tags: ["политика", "экология", "культура"],
		reaction: { likes: 180, dislikes: 7 },
		views: 2600,
	},
]
